Revit 2026 API

# IExternalService Methods

---

The IExternalService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Implement this method to execute the given server. |
|  | GetDescription | Implement this method to return a description of the service. |
|  | GetName | Implement this method to return the name of the service. |
|  | GetServiceId | Implement this method to return the unique Id of the service. |
|  | GetVendorId | Implement this method to return the vendor Id of the service. |
|  | IsValidServer | Implement this method to check if the given instance represents a valid server of this service. |
|  | OnServersChanged |  |
|  | OnServersDisparity |  |

#### Reference

IExternalService Interface

Autodesk.Revit.DB.ExternalService Namespace